[
    {
        "type": "text",
        "text": "Curiosity-Driven Reinforcement Learning for Dynamic Flexible Job Shop Scheduling ",
        "text_level": 1,
        "bbox": [
            137,
            64,
            862,
            131
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "$1 ^ { \\mathrm { s t } }$ Le Xia∗, $2 ^ { \\mathrm { n d } }$ Tao $\\mathrm { { X u ^ { * } } }$ , $3 ^ { \\mathrm { r d } }$ Zhiwei Liu∗, and $4 ^ { \\mathrm { t h } }$ Bi Wang∗† ∗School of Information Engineering, Jiangxi University of Science and Technology, Ganzhou 341000, China †Jiangxi Provincial Key Laboratory of Multidimensional Intelligent Perception and Control, Ganzhou 341000, China Emails: {6720230789, 6720230825, 6720230855} $@$ mail.jxust.edu.cn, wangbi@jxust.edu.cn ",
        "bbox": [
            145,
            150,
            852,
            209
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Abstract—The dynamic flexible job shop scheduling (DFJSP) problem involves assigning appropriate jobs to available machines in real time under uncertain conditions. Reinforcement learning (RL) approaches hold promise for adaptive scheduling but often suffers from sample inefficiency due to sparse and delayed rewards. This paper proposes a curiosity-driven RL framework for the DFJSP with stochastic job arrivals. A centralized policy sequentially activates machines to select jobs with the objective of minimizing total tardiness. The curiositybased intrinsic reward is incorporated to alleviate the exploration deficiency by encouraging the agent to explore novel and informative states. This intrinsic motivation improves sample efficiency in dynamic and sparse-rewards environments. The performance gain depends on scenario characteristics: it is particularly pronounced in high-load, dynamic environments, while in low-load, more predictable settings, improvements are moderate. These findings highlight the framework’s potential for adaptive, data-efficient scheduling under uncertainty. ",
        "bbox": [
            78,
            244,
            490,
            470
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Index Terms—Dynamic Flexible Job Shop Scheduling, Reinforcement Learning, Intrinsic Motivation, Curiosity-Driven Learning, Stochastic Job Arrivals ",
        "bbox": [
            76,
            472,
            488,
            508
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "I. INTRODUCTION ",
        "text_level": 1,
        "bbox": [
            220,
            523,
            348,
            536
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "The Dynamic Flexible Job Shop Scheduling Problem (DFJSP) is a challenging combinatorial optimization problem in modern manufacturing systems [1]. Extending the classical Job Shop Scheduling Problem (JSSP), DFJSP adds flexibility—allowing each operation to be processed on multiple alternative machines—and dynamism—capturing stochastic factors such as random job arrivals and environmental uncertainties [2], [3]. These features make DFJSP NP-hard and timedependent, rendering traditional heuristics and mathematical optimization methods computationally intractable [4]. ",
        "bbox": [
            80,
            542,
            488,
            693
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "In recent years, Reinforcement Learning (RL), particularly Deep Reinforcement Learning (DRL), has emerged as a promising paradigm for adaptive and data-driven scheduling [5]. By formulating the scheduling process as a Markov Decision Process (MDP), an RL agent can learn a mapping from system states (e.g., machine conditions, job queues) to actions (e.g., selecting which job to process) through interaction with the environment. This framework enables the discovery of effective scheduling policies that adapt to dynamic and stochastic conditions without relying on handcrafted rules or explicit system modeling [6]. However, applying RL to DFJSP remains sample-inefficient exploration due to the sparse and delayed reward problem inherent in scheduling tasks [7]. ",
        "bbox": [
            78,
            695,
            488,
            859
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "",
        "bbox": [
            508,
            243,
            919,
            272
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "In most DFJSP settings, the primary objective—such as minimizing total tardiness or makespan—can only be measured after all jobs have been completed. Consequently, the agent receives a single terminal reward after a long sequence of scheduling decisions [8]. This results in sparse and delayed feedback, making it difficult to assign credit to individual actions that contributed to the final performance [9]. The weak and noisy learning signal reduces sample efficiency, slows convergence, and often leads to unstable or suboptimal policies [10]. In effect, the agent must navigate a vast decision space with little intermediate guidance. ",
        "bbox": [
            508,
            273,
            919,
            438
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "To alleviate this challenge, various techniques have been proposed. Reward shaping [11] is one of the most common strategies, in which domain-specific dense rewards are manually designed to provide more frequent feedback. For instance, intermediate rewards may be based on reductions in idle time or operation delay to encourage efficient resource utilization [12]. Although such approaches can accelerate learning, they heavily rely on expert knowledge, and a poorly designed reward function can bias the learning process toward locally optimal but globally suboptimal solutions [7]. ",
        "bbox": [
            508,
            439,
            919,
            589
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "This paper proposes a curiosity-driven reinforcement learning framework for DFJSP with stochastic job arrivals. The agent operates from a machine-centric perspective, sequentially selecting which job each available machine should process next, and leverages a curiosity-based intrinsic reward to encourage exploration toward novel and informative scheduling states. ",
        "bbox": [
            508,
            590,
            918,
            694
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "Comprehensive experiments on six DFJSP scenarios show that incorporating intrinsic motivation consistently improves total tardiness and accelerates convergence compared to a baseline agent. The benefits are especially pronounced under highly dynamic conditions with larger job counts or higher arrival rates. These observations highlight the effectiveness of curiosity-driven exploration in overcoming sparse reward challenges and suggest a promising direction for developing more autonomous and adaptable intelligent scheduling systems ",
        "bbox": [
            508,
            695,
            919,
            830
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "II. METHODOLOGY ",
        "text_level": 1,
        "bbox": [
            643,
            840,
            782,
            853
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "A. Problem Formulation ",
        "text_level": 1,
        "bbox": [
            508,
            858,
            673,
            872
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "The DFJSP with stochastic job arrivals is defined as follows. A set of jobs $J = \\{ J _ { 1 } , J _ { 2 } , \\dots , J _ { n } \\}$ arrives over time and must be processed on a set of machines $M = \\left\\{ M _ { 1 } , M _ { 2 } , \\dots , M _ { m } \\right\\}$ . Each job $J _ { i }$ consists of $N _ { i }$ operations $O _ { i , j }$ , each executable on one of several alternative machines $M _ { i , j } \\subseteq M$ with processing time $t _ { i , j , k }$ on machine $M _ { k }$ . Each job has an arrival time $a _ { i }$ , due date $d _ { i }$ , and completion time $C _ { i }$ . The objective is to minimize total tardiness: ",
        "bbox": [
            508,
            877,
            919,
            907
        ],
        "page_idx": 0
    },
    {
        "type": "discarded",
        "text": "This work was supported by Jiangxi Provincial Key Laboratory of Multidimensional Intelligent Perception and Control of China (No. 2024SSY03161). Corresponding author: Bi Wang (wangbi@jxust.edu.cn). ",
        "bbox": [
            78,
            872,
            488,
            906
        ],
        "page_idx": 0
    },
    {
        "type": "text",
        "text": "",
        "bbox": [
            76,
            61,
            490,
            151
        ],
        "page_idx": 1
    },
    {
        "type": "equation",
        "img_path": "images/0e48ebfb889b56e020dac3163bb4c763fc588e4e17b56858cbfeb8b4665b1504.jpg",
        "text": "$$\n\\operatorname { M i n i m i z e } \\sum _ { i = 1 } ^ { n } \\operatorname* { m a x } \\{ C _ { i } - d _ { i } , 0 \\}\n$$",
        "text_format": "latex",
        "bbox": [
            178,
            152,
            388,
            193
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "To ensure feasibility, the following constraints must be satisfied: 1)Each machine processes at most one operation at any time; 2)Operations of each job follow a fixed order; 3)Once started, an operation runs to completion; 4)Setup, transfer, and decision delays are ignored; ",
        "bbox": [
            78,
            195,
            490,
            270
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "B. Reinforcement Learning Formulation ",
        "text_level": 1,
        "bbox": [
            78,
            277,
            348,
            291
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "The DFJSP is formulated as an MDP $( S , A , P , r , \\gamma )$ . At each decision step $t$ , a centralized agent selects a job for an active machine. If multiple machines become idle simultaneously, one is randomly chosen to make a decision, ensuring a sequential and conflict-free scheduling process. ",
        "bbox": [
            78,
            295,
            490,
            369
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "The state $s _ { t } \\in S$ comprises local features, which describe the immediate decision context, and global features, which capture the overall system status. A detailed breakdown of the features constituting the state vector is presented in Table I. The action $a _ { t } \\in A$ corresponds to selecting one job from a dynamically constructed candidate set, described in Subsection II-C. After execution, the agent receives a reward, described in Subsection II-D. An overview is shown in Fig .1. ",
        "bbox": [
            78,
            371,
            490,
            445
        ],
        "page_idx": 1
    },
    {
        "type": "table",
        "img_path": "images/46bb12af8aa79f56dffbb734c017b86dbebeb14ec7479f2d3703f99ec7d09252.jpg",
        "table_caption": [
            "TABLE I: State features for the scheduling agent. "
        ],
        "table_footnote": [],
        "table_body": "<table><tr><td>Category</td><td>Feature</td><td>Description</td></tr><tr><td rowspan=\"2\">Local</td><td>Orem Trem</td><td>Remaining operations for each candidate job Remaining processing time for each candidate</td></tr><tr><td>Tslack</td><td>job Slack time: due date minus remaining processing time</td></tr><tr><td rowspan=\"2\">Global</td><td>Um μTrem</td><td>Current machine utilization Mean remaining processing time of all unfin- ished jobs</td></tr><tr><td>OTrem μUM</td><td>Std. deviation of remaining processing time Mean machine utilization</td></tr></table>",
        "bbox": [
            78,
            476,
            490,
            646
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "",
        "bbox": [
            76,
            656,
            490,
            702
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "C. Action Masking and Candidate Generation ",
        "text_level": 1,
        "bbox": [
            78,
            723,
            390,
            738
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "At each decision step, the active machine $m$ determines the set of jobs that are eligible for its next processing operation. To structure the action space, four classical priority dispatching rules (PDRs)–Earliest Due Date (EDD), Critical Ratio (CR), Shortest Processing Time (SPT), and Minimum Slack (MS)– are used to rank the available jobs. Each rule contributes its highest-ranked job that is not already included in the candidate pool $\\mathcal { C }$ , proceeding down the ranking if necessary to avoid duplicates. This process yields at most four distinct candidate actions. If fewer than four candidates are obtained, dummy masked actions are added to ensure a fixed action dimension. ",
        "bbox": [
            78,
            741,
            490,
            907
        ],
        "page_idx": 1
    },
    {
        "type": "image",
        "img_path": "images/897b0eff8041535f552310286e084bca0b6b3e7fdfaa9c6225c063d4512084db.jpg",
        "image_caption": [
            "Fig. 1: Four dispatching rules (EDD, CR, SPT, MS) each recommend one candidate job. If fewer than four feasible jobs exist, masked dummy actions maintain a fixed action space. The state vector is constructed from features of these candidates and global system attributes. "
        ],
        "image_footnote": [],
        "bbox": [
            532,
            64,
            898,
            277
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "D. Extrinsic and Intrinsic Reward ",
        "text_level": 1,
        "bbox": [
            508,
            387,
            740,
            401
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "The proposed framework combines extrinsic rewards for scheduling objectives with intrinsic rewards to enhance learning under sparse feedback. ",
        "bbox": [
            508,
            405,
            919,
            449
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "a) Extrinsic Reward: The primary objective of the scheduling task is to minimize the total tardiness of all jobs. At the end of each episode, the total tardiness is computed as ",
        "bbox": [
            508,
            450,
            919,
            494
        ],
        "page_idx": 1
    },
    {
        "type": "equation",
        "img_path": "images/12e8d568537e8a16c5b04bcc70091119338eab461afd01eb42e624b0a9cbfc35.jpg",
        "text": "$$\nT _ { \\mathrm { t o t a l } } = \\sum _ { i = 1 } ^ { n } \\operatorname* { m a x } ( 0 , C _ { i } - d _ { i } ) ,\n$$",
        "text_format": "latex",
        "bbox": [
            614,
            497,
            810,
            539
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "where $C _ { i }$ and $d _ { i }$ denote the completion time and due date of job $i$ , respectively. A negative terminal reward is then assigned to stabilize training: ",
        "bbox": [
            506,
            541,
            919,
            587
        ],
        "page_idx": 1
    },
    {
        "type": "equation",
        "img_path": "images/6bb20babfed39710b40759247d865d4b2c5c55a4b205234224610960d0d5ca60.jpg",
        "text": "$$\nr _ { T } ^ { \\mathrm { e x t } } = - \\log ( 1 + T _ { \\mathrm { t o t a l } } ) .\n$$",
        "text_format": "latex",
        "bbox": [
            633,
            592,
            794,
            609
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "The logarithmic transformation stabilizes training by smoothing large tardiness values and reducing gradient variance. No external reward is given at intermediate steps, i.e., $r _ { t } ^ { \\mathrm { e x t } } = 0$ for $t < T$ . ",
        "bbox": [
            506,
            614,
            919,
            674
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "$b$ ) Intrinsic Reward: ICM: To encourage exploration under sparse extrinsic feedback, we employ the Intrinsic Curiosity Module (ICM) [13]. ICM consists of a forward model predicting the next-state representation $\\hat { \\phi } ( s _ { t + 1 } )$ given $( s _ { t } , a _ { t } )$ , and an inverse model reconstructing the action from $\\left( { { s _ { t } } , { s _ { t + 1 } } } \\right)$ . The intrinsic reward is defined as the forward model’s prediction error: ",
        "bbox": [
            508,
            675,
            919,
            780
        ],
        "page_idx": 1
    },
    {
        "type": "equation",
        "img_path": "images/7bd8aed1e33b71824d9b37928cf6ff38ec550d894fabb67dad0a53823b8efce6.jpg",
        "text": "$$\nr _ { t } ^ { \\mathrm { I C M } } = \\lVert \\hat { \\phi } ( s _ { t + 1 } ) - \\phi ( s _ { t + 1 } ) \\rVert _ { 2 } ^ { 2 } ,\n$$",
        "text_format": "latex",
        "bbox": [
            607,
            782,
            818,
            806
        ],
        "page_idx": 1
    },
    {
        "type": "text",
        "text": "where $\\phi ( \\cdot )$ denotes a shared feature encoder. This reward motivates the agent to visit transitions that are difficult to predict. The forward model error can be decomposed into epistemic (reducible) and aleatoric (irreducible) components: ",
        "bbox": [
            508,
            809,
            918,
            869
        ],
        "page_idx": 1
    },
    {
        "type": "equation",
        "img_path": "images/af8a9af9122bdca8008159896c70282ea37b9dd71c1c91e47fce712c6c0c4af6.jpg",
        "text": "$$\n\\begin{array} { r }  \\mathbb { E } _ { s ^ { \\prime } } \\big [ \\| \\hat { f } _ { \\theta } - \\phi ( s ^ { \\prime } ) \\| ^ { 2 } \\big ] = \\underbrace { \\| \\mathbb { E } _ { s ^ { \\prime } } [ \\phi ( s ^ { \\prime } ) ] - \\hat { f } _ { \\theta } \\| ^ { 2 } } _  \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ I ~ } \\mathrm { ~ I ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm { ~ } \\mathrm  \\end{array}\n$$",
        "text_format": "latex",
        "bbox": [
            516,
            872,
            888,
            897
        ],
        "page_idx": 1
    },
    {
        "type": "image",
        "img_path": "images/90368002b027542371f24e76bd270d56a19d8e86f6ce4582880bfbae96cf8f98.jpg",
        "image_caption": [
            "Fig. 2: Training results across six DFJSP scenarios (X: steps, Y: tardiness) "
        ],
        "image_footnote": [],
        "bbox": [
            91,
            75,
            911,
            430
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "By emphasizing epistemic uncertainty, ICM facilitates structured exploration in predictable, low-load environments. ",
        "bbox": [
            76,
            478,
            488,
            507
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "c) Intrinsic Reward: RND: As an alternative, Random Network Distillation (RND) [14] estimates state novelty via prediction error. A fixed random target network $g ( \\cdot )$ produces deterministic state embeddings, while a predictor network ${ \\hat { g } } _ { \\psi } ( \\cdot )$ is trained to approximate them. The intrinsic reward is ",
        "bbox": [
            78,
            510,
            488,
            587
        ],
        "page_idx": 2
    },
    {
        "type": "equation",
        "img_path": "images/beca70ac45ba8638d972e73937bd01140444af0f3d35ee0c8675df9812c29a43.jpg",
        "text": "$$\nr _ { t } ^ { \\mathrm { R N D } } = \\lVert \\hat { g } _ { \\psi } ( \\phi ( s _ { t } ) ) - g ( \\phi ( s _ { t } ) ) \\rVert _ { 2 } ^ { 2 } .\n$$",
        "text_format": "latex",
        "bbox": [
            168,
            597,
            400,
            621
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Under the empirical state distribution $d ^ { \\pi }$ , the expected reward satisfies ",
        "bbox": [
            76,
            631,
            488,
            662
        ],
        "page_idx": 2
    },
    {
        "type": "equation",
        "img_path": "images/b85c53fc00a80d53bc1ec7fdc5d4ecb6d34c2e5b0e81cd636d4faa551eaaa59a.jpg",
        "text": "$$\n\\begin{array} { r } { \\mathbb { E } _ { s \\sim d ^ { \\pi } } [ r ^ { \\mathrm { R N D } } ( s ) ] = \\mathbb { E } _ { s \\sim d ^ { \\pi } } \\left[ \\| g ( \\phi ( s ) ) - \\hat { g } _ { \\psi } ( \\phi ( s ) ) \\| ^ { 2 } \\right] . } \\end{array}\n$$",
        "text_format": "latex",
        "bbox": [
            99,
            674,
            449,
            694
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "For frequently visited states $( d ^ { \\pi } ( s )$ high), ${ \\hat { g } } _ { \\psi }$ fits well and $r ^ { \\mathrm { R N D } } ( s ) \\stackrel { - } {  } \\stackrel { - } { 0 }$ ; for rare states, the prediction error remains large. Unlike ICM, RND’s novelty estimation is independent of transition uncertainty $P ( s ^ { \\prime } | s , a )$ , making it robust to highload stochastic environments where simple diversity-driven exploration suffices. ",
        "bbox": [
            78,
            707,
            490,
            797
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "d) Total Reward: The agent’s total reward combines extrinsic and intrinsic components: ",
        "bbox": [
            76,
            801,
            490,
            832
        ],
        "page_idx": 2
    },
    {
        "type": "equation",
        "img_path": "images/2b21ebd6ed2c16613eef0ae832eba6314e1dd46261f2a568366f3c7b3afdf006.jpg",
        "text": "$$\nr _ { t } = r _ { t } ^ { \\mathrm { e x t } } + \\beta r _ { t } ^ { \\mathrm { i n t } } ,\n$$",
        "text_format": "latex",
        "bbox": [
            225,
            843,
            343,
            864
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "where $\\boldsymbol { r } _ { t } ^ { \\mathrm { i n t } }$ corresponds to either ICM or RND, and $\\beta$ balances exploration and exploitation. ",
        "bbox": [
            78,
            876,
            490,
            907
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "III. EXPERIMENTS ",
        "text_level": 1,
        "bbox": [
            647,
            478,
            779,
            491
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "A. Experimental Setup ",
        "text_level": 1,
        "bbox": [
            508,
            497,
            661,
            512
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "The proposed methods were evaluated in a DFJSP environment, where new jobs arrive according to a Poisson process with rate $\\lambda$ . Each job consists of 10–15 operations, each of which can be processed on one of several alternative machines. The environment is initialized with 10 available jobs, and the number of machines is fixed at 10 in all experiments. To examine scalability and robustness, six scenario combinations are considered: S1–S6 correspond to (Job number, $\\lambda ) = ( 2 5 , 0 . 0 5 )$ , (25, 0.10), (50, 0.05), (50, 0.10), (70, 0.05), and (70, 0.10). Each method is evaluated over 100 independent episodes with different random seeds to ensure statistical reliability. ",
        "bbox": [
            508,
            517,
            919,
            681
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "The RL agent is implemented using MaskablePPO [15] from the stable-baselines3 [16]. Intrinsic motivation is provided by curiosity modules, including ICM and RND, from the RLLTE [17] and RLeXplore [18]. ",
        "bbox": [
            506,
            683,
            919,
            743
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "The key hyperparameters and network architecture are summarized in Table II. ",
        "bbox": [
            508,
            744,
            919,
            772
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Three methods are compared: MPPO (MaskablePPO baseline), MPPO-ICM (MPPO with Intrinsic Curiosity Module), and MPPO-RND (MPPO with Random Network Distillation). Performance is measured by the average total tardiness across 100 evaluation episodes per scenario. ",
        "bbox": [
            508,
            773,
            919,
            848
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "B. Experimental Results ",
        "text_level": 1,
        "bbox": [
            508,
            858,
            673,
            872
        ],
        "page_idx": 2
    },
    {
        "type": "text",
        "text": "Table III reports the average total tardiness over 100 evaluation episodes for MPPO, MPPO-ICM, and MPPO-RND across six DFJSP scenarios. MPPO-ICM consistently outperforms the baseline MPPO in all scenarios, while MPPO-RND shows improvements mainly in high-load scenarios with larger job counts or higher arrival rates (S4–S6) and performs comparably or slightly worse in low-load scenarios (S1–S3). ",
        "bbox": [
            508,
            877,
            919,
            907
        ],
        "page_idx": 2
    },
    {
        "type": "table",
        "img_path": "images/fdb3d014140af3dafa943f7a853b75301d5552c04b7fc4183600893ae2759d4d.jpg",
        "table_caption": [
            "TABLE II: Key Hyperparameters and Network Architecture. "
        ],
        "table_footnote": [
            "Indicates default value from Stable-Baselines3. "
        ],
        "table_body": "<table><tr><td rowspan=1 colspan=1>Category</td><td rowspan=1 colspan=1>Hyperparameter</td><td rowspan=1 colspan=1>Value</td></tr><tr><td rowspan=1 colspan=1>RL Algorithm</td><td rowspan=1 colspan=1>Discount Factor ()GAE Parameter (入)Clipping Range (ε)PPO EpochsMinibatch SizeValue Loss CoefficientEntropy CoefficientTarget KL Divergence</td><td rowspan=1 colspan=1>0.9950.95 a0.210a20480.5 a0.0010.02</td></tr><tr><td rowspan=1 colspan=1>Network and Optimizer</td><td rowspan=1 colspan=1>Hidden Layer DimensionsActivation FunctionOptimizerLearning Rate</td><td rowspan=1 colspan=1>(128,128,64)LeakyReLUAdama3e-4</td></tr><tr><td rowspan=1 colspan=1>Training Setup</td><td rowspan=1 colspan=1>Total TimestepsOn-policy Buffer Size (n_steps)Number of Parallel EnvironmentsObservation NormalizationReward NormalizationIntrinsic Reward Weight (β)</td><td rowspan=1 colspan=1>1.5e620488TrueTrue0.5</td></tr></table>",
        "bbox": [
            78,
            80,
            490,
            308
        ],
        "page_idx": 3
    },
    {
        "type": "table",
        "img_path": "images/f7caf7aeeed053be6e6c1578de522059741b1da60f6602388955c467564b6de7.jpg",
        "table_caption": [
            "TABLE III: Average total tardiness of the evaluated methods. "
        ],
        "table_footnote": [],
        "table_body": "<table><tr><td>Method</td><td>S1</td><td>S2</td><td>S3</td><td>S4</td><td>S5</td><td>S6</td></tr><tr><td>MPPO</td><td>528.15</td><td>1177.91</td><td>727.18</td><td>3578.31</td><td>774.59</td><td>6430.17</td></tr><tr><td>MPPO-ICM</td><td>465.46</td><td>1045.28</td><td>686.19</td><td>3016.24</td><td>675.08</td><td>6012.54</td></tr><tr><td>MPPO-RND</td><td>571.22</td><td>1180.72</td><td>724.85</td><td>2876.08</td><td>578.36</td><td>5705.83</td></tr></table>",
        "bbox": [
            81,
            354,
            486,
            406
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "",
        "bbox": [
            78,
            434,
            490,
            510
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "These trends align with the theoretical characteristics of the intrinsic reward mechanisms (Section II-D). As shown in Fig. 2, ICM, emphasizing epistemic uncertainty, converges faster in low-load, predictable environments, promoting structured exploration. RND, estimating state novelty independent of transition uncertainty, is more robust under high-load stochastic conditions, achieving lower final tardiness where diversity-driven exploration is beneficial. Overall, incorporating intrinsic motivation reduces total tardiness, with the relative effectiveness of ICM or RND depending on system load and scenario characteristics. ",
        "bbox": [
            78,
            511,
            490,
            676
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "IV. CONCLUSION ",
        "text_level": 1,
        "bbox": [
            222,
            689,
            346,
            703
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "This paper presents a curiosity-driven reinforcement learn ing framework to mitigate sample inefficiency under sparse rewards in DFJSP. By augmenting a MaskablePPO agent with intrinsic motivation mechanisms (ICM and RND), the framework promotes efficient exploration and yields policies that consistently reduce total tardiness compared to the baseline. ",
        "bbox": [
            78,
            710,
            490,
            801
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Theoretical analysis explains the observed performance differences: in low-load scenarios with largely deterministic transitions, ICM leverages prediction-error-based curiosity to drive structured exploration and generalize across sparse state spaces; in high-load stochastic scenarios, RND’s fixed random network provides stable novelty signals, mitigating the impact of noisy predictions in ICM and enabling faster convergence toward exploitation. These results highlight the interplay between intrinsic reward design, system load, and transition dynamics. ",
        "bbox": [
            80,
            803,
            490,
            907
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "",
        "bbox": [
            508,
            61,
            918,
            107
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "Limitations include a constrained action space and central ized agent architecture, which may restrict policy discovery and scalability. Future work will explore adaptive intrinsic motivation, richer state/action representations, and multi-agent architectures for improved robustness and generalization. ",
        "bbox": [
            508,
            108,
            919,
            183
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "REFERENCES ",
        "text_level": 1,
        "bbox": [
            666,
            191,
            759,
            205
        ],
        "page_idx": 3
    },
    {
        "type": "text",
        "text": "[1] W. Gu, S. Liu, Z. Guo, M. Yuan, and F. Pei, “Dynamic scheduling mechanism for intelligent workshop with deep reinforcement learning method based on multi-agent system architecture,” Computers & Industrial Engineering, vol. 191, p. 110155, 2024.   \n[2] K. Gao, F. Yang, M. Zhou, Q. Pan, and P. N. Suganthan, “Flexible job-shop rescheduling for new job insertion by using discrete jaya algorithm,” IEEE transactions on cybernetics, vol. 49, no. 5, pp. 1944– 1955, 2018.   \n[3] W. Song, X. Chen, Q. Li, and Z. Cao, “Flexible job-shop scheduling via graph neural network and deep reinforcement learning,” IEEE Transactions on Industrial Informatics, vol. 19, no. 2, pp. 1600–1610, 2022. [4] R. Liu, R. Piplani, and C. Toro, “A deep multi-agent reinforcement learning approach to solve dynamic job shop scheduling problem,” Computers & Operations Research, vol. 159, p. 106294, 2023.   \n[5] Y. Gui, D. Tang, H. Zhu, Y. Zhang, and Z. Zhang, “Dynamic scheduling for flexible job shop using a deep reinforcement learning approach,” Computers & Industrial Engineering, vol. 180, p. 109255, 2023.   \n[6] L. Wang, X. Hu, Y. Wang, S. Xu, S. Ma, K. Yang, Z. Liu, and W. Wang, “Dynamic job-shop scheduling in smart manufacturing using deep reinforcement learning,” Computer networks, vol. 190, p. 107969, 2021. [7] L. Zhang, Y. Feng, Q. Xiao, Y. Xu, D. Li, D. Yang, and Z. Yang, “Deep reinforcement learning for dynamic flexible job shop scheduling problem considering variable processing times,” Journal of Manufacturing systems, vol. 71, pp. 257–273, 2023.   \n[8] Z. Wu, H. Fan, Y. Sun, and M. Peng, “Efficient multi-objective optimization on dynamic flexible job shop scheduling using deep reinforcement learning approach,” Processes, vol. 11, no. 7, p. 2018, 2023.   \n[9] P. Tassel, M. Gebser, and K. Schekotihin, “A reinforcement learning environment for job-shop scheduling,” arXiv preprint arXiv:2104.03760, 2021.   \n[10] A. Nasuta, M. Kemmerling, D. Lutticke, and R. H. Schmitt, “Reward ¨ shaping for job shop scheduling,” in International Conference on Machine Learning, Optimization, and Data Science. Springer, 2023, pp. 197–211.   \n[11] R. Liu, R. Piplani, and C. Toro, “Deep reinforcement learning for dynamic scheduling of a flexible job shop,” International Journal of Production Research, vol. 60, no. 13, pp. 4049–4069, 2022.   \n[12] T. Zheng, Y. Zhou, M. Hu, and J. Zhang, “Dynamic scheduling for largescale flexible job shop based on noisy ddqn,” International Journal of Network Dynamics and Intelligence, pp. 100 015–100 015, 2023.   \n[13] D. Pathak, P. Agrawal, A. A. Efros, and T. Darrell, “Curiosity-driven exploration by self-supervised prediction,” in International conference on machine learning. PMLR, 2017, pp. 2778–2787.   \n[14] Y. Burda, H. Edwards, A. Storkey, and O. Klimov, “Exploration by random network distillation,” arXiv preprint arXiv:1810.12894, 2018.   \n[15] S. Huang and S. Ontan˜on, “A closer look at invalid action masking in ´ policy gradient algorithms,” arXiv preprint arXiv:2006.14171, 2020.   \n[16] A. Raffin, A. Hill, A. Gleave, A. Kanervisto, M. Ernestus, and N. Dormann, “Stable-baselines3: Reliable reinforcement learning implementations,” Journal of Machine Learning Research, vol. 22, no. 268, pp. 1–8, 2021. [Online]. Available: http://jmlr.org/papers/v22/20- 1364.html   \n[17] M. Yuan, Z. Zhang, Y. Xu, J. S. Luo, B. Li, X. Jin, and W. Zeng, “RLLTE: Long-term evolution project of reinforcement learning,” in Proceedings of the AAAI Conference on Artificial Intelligence, 2025.   \n[18] M. Yuan, R. C. Castanyer, B. Li, X. Jin, G. Berseth, and W. Zeng, “Rlexplore: Accelerating research in intrinsically-motivated reinforcement learning,” Transactions on Machine Learning Research, 2025. [Online]. Available: https://openreview.net/forum?id=B9BHjTN4z6 ",
        "bbox": [
            509,
            212,
            919,
            901
        ],
        "page_idx": 3
    }
]